---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CorrectionFactorSet.#ctor
source: html/1a3bc9f7-528e-0c50-e7e5-ed24890a3e6f.htm
---
# Autodesk.Revit.DB.Electrical.CorrectionFactorSet.#ctor Method

Initializes a new instance of the CorrectionFactorSet class

## Syntax (C#)
```csharp
public CorrectionFactorSet()
```